---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotBeMirroredWithoutItsCurves
source: html/127a5ed6-56cb-57fc-3f2f-aea94cb16f86.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures.DividedPathCannotBeMirroredWithoutItsCurves Property

Divided path cannot be mirrored without its curves.

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedPathCannotBeMirroredWithoutItsCurves { get; }
```